; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v2 ?v12)
             (pred_7 ?v4 ?v10)
             (pred_6 ?v2 ?v10)
             (pred_5 ?v1 ?v2 )
	     (pred_1 ?v2)
             (pred_8 ?v8)
             (pred_12 ?v4)
             (pred_4 ?v10)
             (pred_9 ?v2)
             (pred_3 ?v4)
             (pred_2 ?v2)
             (pred_11 ))



(:action op_4
:parameters (?v11 ?v6 ?v3 ?v13)
:precondition (and (pred_8 ?v11) (pred_8 ?v6) (pred_12 ?v3) (pred_4 ?v13)
          (pred_10 ?v11 ?v6) (pred_7 ?v3 ?v13)
                   (pred_6 ?v6 ?v13) (pred_1 ?v11) 
                   (pred_9 ?v6) (pred_3 ?v3))
:effect (and  (pred_2 ?v6) (not (pred_9 ?v6))))


(:action op_3
:parameters (?v11 ?v5)
:precondition (and (pred_8 ?v11) (pred_8 ?v5)
               (pred_1 ?v11) (pred_10 ?v11 ?v5) (pred_2 ?v5))
:effect (and (pred_1 ?v5) (not (pred_1 ?v11))))

(:action op_5
:parameters (?v11 ?v3)
:precondition (and (pred_8 ?v11) (pred_12 ?v3) 
                  (pred_1 ?v11) (pred_5 ?v3 ?v11) (pred_11 ))
:effect (and (pred_3 ?v3)
   (not (pred_5 ?v3 ?v11)) (not (pred_11 ))))


(:action op_2
:parameters (?v11 ?v7 ?v9)
:precondition (and (pred_8 ?v11) (pred_12 ?v7) (pred_12 ?v9)
                  (pred_1 ?v11) (pred_3 ?v9) (pred_5 ?v7 ?v11))
:effect (and (pred_3 ?v7) (pred_5 ?v9 ?v11)
        (not (pred_3 ?v9)) (not (pred_5 ?v7 ?v11))))

(:action op_1
:parameters (?v11 ?v3)
:precondition (and (pred_8 ?v11) (pred_12 ?v3) 
                  (pred_1 ?v11) (pred_3 ?v3))
:effect (and (pred_11 ) (pred_5 ?v3 ?v11) (not (pred_3 ?v3)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_06 obj_11 obj_25 obj_32 obj_10 obj_03 obj_14 obj_04 obj_27 obj_28 obj_17 obj_20 obj_31 obj_05 obj_23 obj_24 obj_16 obj_18 obj_15 obj_09 obj_22 obj_29 obj_07 obj_19 obj_21
    obj_02 obj_26 obj_08
    obj_13 obj_01 obj_12 obj_30
    )

    (:init
       (pred_11)

       (pred_8 obj_06)
       (pred_8 obj_11)
       (pred_8 obj_25)
       (pred_8 obj_32)
       (pred_8 obj_10)
       (pred_8 obj_03)
       (pred_8 obj_14)
       (pred_8 obj_04)
       (pred_8 obj_27)
       (pred_8 obj_28)
       (pred_8 obj_17)
       (pred_8 obj_20)
       (pred_8 obj_31)
       (pred_8 obj_05)
       (pred_8 obj_23)
       (pred_8 obj_24)
       (pred_8 obj_16)
       (pred_8 obj_18)
       (pred_8 obj_15)
       (pred_8 obj_09)
       (pred_8 obj_22)
       (pred_8 obj_29)
       (pred_8 obj_07)
       (pred_8 obj_19)
       (pred_8 obj_21)
       (pred_4 obj_02)
       (pred_4 obj_26)
       (pred_4 obj_08)
       (pred_12 obj_13)
       (pred_12 obj_01)
       (pred_12 obj_12)
       (pred_12 obj_30)

       (pred_10 obj_06 obj_03)
       (pred_10 obj_06 obj_11)
       (pred_10 obj_11 obj_14)
       (pred_10 obj_11 obj_25)
       (pred_10 obj_11 obj_06)
       (pred_10 obj_25 obj_04)
       (pred_10 obj_25 obj_32)
       (pred_10 obj_25 obj_11)
       (pred_10 obj_32 obj_27)
       (pred_10 obj_32 obj_10)
       (pred_10 obj_32 obj_25)
       (pred_10 obj_10 obj_28)
       (pred_10 obj_10 obj_32)
       (pred_10 obj_03 obj_17)
       (pred_10 obj_03 obj_14)
       (pred_10 obj_03 obj_06)
       (pred_10 obj_14 obj_20)
       (pred_10 obj_14 obj_04)
       (pred_10 obj_14 obj_11)
       (pred_10 obj_14 obj_03)
       (pred_10 obj_04 obj_31)
       (pred_10 obj_04 obj_27)
       (pred_10 obj_04 obj_25)
       (pred_10 obj_04 obj_14)
       (pred_10 obj_27 obj_05)
       (pred_10 obj_27 obj_28)
       (pred_10 obj_27 obj_32)
       (pred_10 obj_27 obj_04)
       (pred_10 obj_28 obj_23)
       (pred_10 obj_28 obj_10)
       (pred_10 obj_28 obj_27)
       (pred_10 obj_17 obj_24)
       (pred_10 obj_17 obj_20)
       (pred_10 obj_17 obj_03)
       (pred_10 obj_20 obj_16)
       (pred_10 obj_20 obj_31)
       (pred_10 obj_20 obj_14)
       (pred_10 obj_20 obj_17)
       (pred_10 obj_31 obj_18)
       (pred_10 obj_31 obj_05)
       (pred_10 obj_31 obj_04)
       (pred_10 obj_31 obj_20)
       (pred_10 obj_05 obj_15)
       (pred_10 obj_05 obj_23)
       (pred_10 obj_05 obj_27)
       (pred_10 obj_05 obj_31)
       (pred_10 obj_23 obj_09)
       (pred_10 obj_23 obj_28)
       (pred_10 obj_23 obj_05)
       (pred_10 obj_24 obj_22)
       (pred_10 obj_24 obj_16)
       (pred_10 obj_24 obj_17)
       (pred_10 obj_16 obj_29)
       (pred_10 obj_16 obj_18)
       (pred_10 obj_16 obj_20)
       (pred_10 obj_16 obj_24)
       (pred_10 obj_18 obj_07)
       (pred_10 obj_18 obj_15)
       (pred_10 obj_18 obj_31)
       (pred_10 obj_18 obj_16)
       (pred_10 obj_15 obj_19)
       (pred_10 obj_15 obj_09)
       (pred_10 obj_15 obj_05)
       (pred_10 obj_15 obj_18)
       (pred_10 obj_09 obj_21)
       (pred_10 obj_09 obj_23)
       (pred_10 obj_09 obj_15)
       (pred_10 obj_22 obj_29)
       (pred_10 obj_22 obj_24)
       (pred_10 obj_29 obj_07)
       (pred_10 obj_29 obj_16)
       (pred_10 obj_29 obj_22)
       (pred_10 obj_07 obj_19)
       (pred_10 obj_07 obj_18)
       (pred_10 obj_07 obj_29)
       (pred_10 obj_19 obj_21)
       (pred_10 obj_19 obj_15)
       (pred_10 obj_19 obj_07)
       (pred_10 obj_21 obj_09)
       (pred_10 obj_21 obj_19)
       (pred_9 obj_16)
       (pred_9 obj_25)
       (pred_9 obj_14)
       (pred_9 obj_31)
       (pred_6  obj_16 obj_02)
       (pred_6  obj_25 obj_26)
       (pred_6  obj_14 obj_08)
       (pred_6  obj_31 obj_02)
       (pred_2 obj_06)
       (pred_2 obj_11)
       (pred_2 obj_32)
       (pred_2 obj_10)
       (pred_2 obj_03)
       (pred_2 obj_04)
       (pred_2 obj_27)
       (pred_2 obj_28)
       (pred_2 obj_17)
       (pred_2 obj_20)
       (pred_2 obj_05)
       (pred_2 obj_23)
       (pred_2 obj_24)
       (pred_2 obj_18)
       (pred_2 obj_15)
       (pred_2 obj_09)
       (pred_2 obj_22)
       (pred_2 obj_29)
       (pred_2 obj_07)
       (pred_2 obj_19)
       (pred_2 obj_21)

       (pred_7  obj_13 obj_02)
       (pred_7  obj_01 obj_26)
       (pred_7  obj_12 obj_08)
       (pred_7  obj_30 obj_26)
       (pred_5 obj_13 obj_15)
       (pred_5 obj_01 obj_04)
       (pred_5 obj_12 obj_19)
       (pred_5 obj_30 obj_32)
       (pred_1 obj_09)
    )

    (:goal (and
       (pred_5 obj_01 obj_10)
       (pred_5 obj_30 obj_23)
    ))
(:constraints
  (always (not (pred_1 obj_05)))
)
)

; plan
1. (op_3 obj_09 obj_23)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_23)
   goals met: 0 of 2
2. (op_3 obj_23 obj_28)
   deleted: (pred_1 obj_23)
   added: (pred_1 obj_28)
   goals met: 0 of 2
3. (op_3 obj_28 obj_27)
   deleted: (pred_1 obj_28)
   added: (pred_1 obj_27)
   goals met: 0 of 2
4. (op_3 obj_27 obj_04)
   deleted: (pred_1 obj_27)
   added: (pred_1 obj_04)
   goals met: 0 of 2
5. (op_5 obj_04 obj_01)
   deleted: (pred_5 obj_01 obj_04) (pred_11)
   added: (pred_3 obj_01)
   goals met: 0 of 2
6. (op_3 obj_04 obj_27)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_27)
   goals met: 0 of 2
7. (op_3 obj_27 obj_32)
   deleted: (pred_1 obj_27)
   added: (pred_1 obj_32)
   goals met: 0 of 2
8. (op_3 obj_32 obj_10)
   deleted: (pred_1 obj_32)
   added: (pred_1 obj_10)
   goals met: 0 of 2
9. (op_1 obj_10 obj_01)
   deleted: (pred_3 obj_01)
   added: (pred_11) (pred_5 obj_01 obj_10)
   goals met: 1 of 2
10. (op_3 obj_10 obj_32)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_32)
   goals met: 1 of 2
11. (op_5 obj_32 obj_30)
   deleted: (pred_5 obj_30 obj_32) (pred_11)
   added: (pred_3 obj_30)
   goals met: 1 of 2
12. (op_3 obj_32 obj_10)
   deleted: (pred_1 obj_32)
   added: (pred_1 obj_10)
   goals met: 1 of 2
13. (op_3 obj_10 obj_28)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_28)
   goals met: 1 of 2
14. (op_3 obj_28 obj_23)
   deleted: (pred_1 obj_28)
   added: (pred_1 obj_23)
   goals met: 1 of 2
15. (op_1 obj_23 obj_30)
   deleted: (pred_3 obj_30)
   added: (pred_11) (pred_5 obj_30 obj_23)
   goals met: 2 of 2
